---
kind: enumMember
id: F:Autodesk.Revit.DB.RoutingPreferenceErrorLevel.None
enum: Autodesk.Revit.DB.RoutingPreferenceErrorLevel
source: html/37b1540d-5fe8-7666-b284-4f8d11c14f45.htm
---
# Autodesk.Revit.DB.RoutingPreferenceErrorLevel.None

Do not post any warning or error if there is no rule in the routing preference satisfying the current condition.